203Electronics/Arduino_STM32/STM32F1/boards.txt
########################### Matrix (RET6) ###########################

matrixC8T6.name=Matrix (C8T6)
matrixC8T6.vid.0=0x0203
matrixC8T6.pid.0=0x0100
matrixC8T6.build.variant=generic_stm32f103c
matrixC8T6.build.vect=VECT_TAB_ADDR=0x8000000
matrixC8T6.build.core=maple
matrixC8T6.build.board=GENERIC_STM32F103C
matrixC8T6.build.error_led_port=GPIOC
matrixC8T6.build.error_led_pin=13
matrixC8T6.upload.use_1200bps_touch=false
matrixC8T6.upload.file_type=bin
matrixC8T6.upload.auto_reset=true
matrixC8T6.upload.tool=maple_upload
matrixC8T6.upload.protocol=maple_dfu

## STM32F103C8 -------------------------
matrixC8T6.menu.device_variant.STM32F103C8=STM32F103C8 (20k RAM. 64k Flash)
matrixC8T6.menu.device_variant.STM32F103C8.build.cpu_flags=-DMCU_STM32F103C8
matrixC8T6.menu.device_variant.STM32F103C8.build.ldscript=ld/jtag_c8.ld
matrixC8T6.menu.device_variant.STM32F103C8.upload.maximum_size=65536
matrixC8T6.menu.device_variant.STM32F103C8.upload.maximum_data_size=20480

## STM32F103CB -------------------------
matrixC8T6.menu.device_variant.STM32F103CB=STM32F103CB (20k RAM. 128k Flash)
matrixC8T6.menu.device_variant.STM32F103CB.build.cpu_flags=-DMCU_STM32F103CB
matrixC8T6.menu.device_variant.STM32F103CB.build.ldscript=ld/jtag.ld
matrixC8T6.menu.device_variant.STM32F103CB.upload.maximum_size=131072
matrixC8T6.menu.device_variant.STM32F103CB.upload.maximum_data_size=20480

#---------------------------- UPLOAD METHODS ---------------------------

matrixC8T6.menu.upload_method.DFUUploadMethod=Matrix bootloader
matrixC8T6.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
matrixC8T6.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
matrixC8T6.menu.upload_method.DFUUploadMethod.build.upload_flags=-DSERIAL_USB -DGENERIC_BOOTLOADER
matrixC8T6.menu.upload_method.DFUUploadMethod.build.vect=VECT_TAB_ADDR=0x8002000
matrixC8T6.menu.upload_method.DFUUploadMethod.build.ldscript=ld/bootloader_20.ld
matrixC8T6.menu.upload_method.DFUUploadMethod.upload.usbID=0203:0003
matrixC8T6.menu.upload_method.DFUUploadMethod.upload.altID=0

#-- CPU Clock frequency
matrixC8T6.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
matrixC8T6.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

matrixC8T6.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
matrixC8T6.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

matrixC8T6.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
matrixC8T6.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
matrixC8T6.menu.opt.osstd=Smallest (default)
#matrixC8T6.menu.opt.oslto=Smallest Code with LTO
#matrixC8T6.menu.opt.oslto.build.flags.optimize=-Os -flto
#matrixC8T6.menu.opt.oslto.build.flags.ldspecs=-flto
matrixC8T6.menu.opt.o1std=Fast (-O1)
matrixC8T6.menu.opt.o1std.build.flags.optimize=-O1
matrixC8T6.menu.opt.o1std.build.flags.ldspecs=
#matrixC8T6.menu.opt.o1lto=Fast (-O1) with LTO
#matrixC8T6.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#matrixC8T6.menu.opt.o1lto.build.flags.ldspecs=-flto
matrixC8T6.menu.opt.o2std=Faster (-O2)
matrixC8T6.menu.opt.o2std.build.flags.optimize=-O2
matrixC8T6.menu.opt.o2std.build.flags.ldspecs=
#matrixC8T6.menu.opt.o2lto=Faster (-O2) with LTO
#matrixC8T6.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#matrixC8T6.menu.opt.o2lto.build.flags.ldspecs=-flto
matrixC8T6.menu.opt.o3std=Fastest (-O3)
matrixC8T6.menu.opt.o3std.build.flags.optimize=-O3
matrixC8T6.menu.opt.o3std.build.flags.ldspecs=
#matrixC8T6.menu.opt.o3lto=Fastest (-O3) with LTO
#matrixC8T6.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#matrixC8T6.menu.opt.o3lto.build.flags.ldspecs=-flto
matrixC8T6.menu.opt.ogstd=Debug (-g)
matrixC8T6.menu.opt.ogstd.build.flags.optimize=-Og
matrixC8T6.menu.opt.ogstd.build.flags.ldspecs=

##############################################################
mapleMini.name=Maple Mini

mapleMini.build.board=MAPLE_MINI
mapleMini.vid.0=0x1EAF
mapleMini.pid.0=0x0004
mapleMini.build.core=maple
mapleMini.build.cpu_flags=-DMCU_STM32F103CB -DSERIAL_USB
mapleMini.build.variant=maple_mini
mapleMini.upload.usbID=1EAF:0003

mapleMini.upload.tool=maple_upload
mapleMini.upload.protocol=maple_dfu
mapleMini.upload.use_1200bps_touch=false
mapleMini.upload.file_type=bin
mapleMini.upload.auto_reset=true

mapleMini.menu.bootloader_version.original = Original (17k RAM,108k Flash)
mapleMini.menu.bootloader_version.original.build.vect=VECT_TAB_ADDR=0x8005000
mapleMini.menu.bootloader_version.original.build.ldscript=ld/flash.ld
mapleMini.menu.bootloader_version.original.upload.maximum_size=110592
mapleMini.menu.bootloader_version.original.upload.maximum_data_size=17408
mapleMini.menu.bootloader_version.original.upload.altID=1

mapleMini.menu.bootloader_version.bootloader20 = Bootloader 2.0 (20k RAM,120k Flash)
mapleMini.menu.bootloader_version.bootloader20.build.vect=VECT_TAB_ADDR=0x8002000
mapleMini.menu.bootloader_version.bootloader20.build.ldscript=ld/bootloader_20.ld
mapleMini.menu.bootloader_version.bootloader20.upload.maximum_size=122880
mapleMini.menu.bootloader_version.bootloader20.upload.maximum_data_size=20480
mapleMini.menu.bootloader_version.bootloader20.upload.altID=2

#-- CPU Clock frequency
mapleMini.menu.cpu_speed.speed_72mhz=72MHz (Normal)
mapleMini.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

mapleMini.menu.cpu_speed.speed_48mhz=48MHz (Slow - with USB)
mapleMini.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

mapleMini.menu.cpu_speed.speed_128mhz=Overclocked 128MHz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
mapleMini.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
mapleMini.menu.opt.osstd=Smallest (default)
#mapleMini.menu.opt.oslto=Smallest Code with LTO
#mapleMini.menu.opt.oslto.build.flags.optimize=-Os -flto
#mapleMini.menu.opt.oslto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o1std=Fast (-O1)
mapleMini.menu.opt.o1std.build.flags.optimize=-O1
mapleMini.menu.opt.o1std.build.flags.ldspecs=
#mapleMini.menu.opt.o1lto=Fast (-O1) with LTO
#mapleMini.menu.opt.o1lto.build.flags.optimize=-O1 -flto
#mapleMini.menu.opt.o1lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o2std=Faster (-O2)
mapleMini.menu.opt.o2std.build.flags.optimize=-O2
mapleMini.menu.opt.o2std.build.flags.ldspecs=
#mapleMini.menu.opt.o2lto=Faster (-O2) with LTO
#mapleMini.menu.opt.o2lto.build.flags.optimize=-O2 -flto
#mapleMini.menu.opt.o2lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.o3std=Fastest (-O3)
mapleMini.menu.opt.o3std.build.flags.optimize=-O3
mapleMini.menu.opt.o3std.build.flags.ldspecs=
#mapleMini.menu.opt.o3lto=Fastest (-O3) with LTO
#mapleMini.menu.opt.o3lto.build.flags.optimize=-O3 -flto
#mapleMini.menu.opt.o3lto.build.flags.ldspecs=-flto
mapleMini.menu.opt.ogstd=Debug (-g)
mapleMini.menu.opt.ogstd.build.flags.optimize=-Og
mapleMini.menu.opt.ogstd.build.flags.ldspecs=


